app/views/statuses/_status.html.erb


    <% if status.tasks.any? %>
---
SELECT 1 AS one FROM "tasks" WHERE "tasks"."status_id" = ? LIMIT ?  [["status_id", 2], ["LIMIT", 1]]