app/views/statuses/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."status_id" = ?  [["status_id", 1]]
---
<h2>Tasks</h2>
<% @status.tasks.each do |task| %>