app/views/statuses/show.html.erb

                                <tbody>
                                  <% @status.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."status_id" = ?  [["status_id", 1]]