app/views/users/dashboard.html.erb

                                    <!-- Display logs for the current user -->
                                    <% current_user.logs.order(timestamp: :desc).limit(10).each do |log| %>
---
SELECT "logs".* FROM "logs" WHERE "logs"."user_id" = ? ORDER BY "logs"."timestamp" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 10]]