app/controllers/application_controller.rb

  def after_sign_in_path_for(resource)
    @current_user = resource
    if resource.role == "admin"
      root_path
    else
      Log.create(user_id: resource.id, timestamp: Time.now, action: 'check-in')
---
INSERT INTO "logs" ("user_id", "timestamp", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["timestamp", "2024-03-05 08:30:59.735667"], ["action", "check-in"], ["created_at", "2024-03-05 08:30:59.872743"], ["updated_at", "2024-03-05 08:30:59.872743"]]