app/controllers/employees_controller.rb

UPDATE "employees" SET "password_digest" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-02-19 12:14:22.073972"], ["id", 1]]
---
  def update
    if @employee.update(employee_params)

INSERT INTO "employees" ("first_name", "last_name", "email", "password_digest", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)
    if @employee.save

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]
---
  def destroy
    @employee.destroy