app/controllers/sessions_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "meetsolanki140@gmail.com"], ["LIMIT", 1]]
---
  def create
    employee = Employee.find_by(email: params[:email])