app/controllers/statuses_controller.rb

  def mark_resolved
    @status = Status.find(params[:id])

    if @status.update(status: 'resolved')
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "statuses" SET "updated_at" = ?, "status" = ? WHERE "statuses"."id" = ?  [["updated_at", "2024-03-05 08:57:36.585998"], ["status", "resolved"], ["id", 1]]

  def mark_completed
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_status
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]