app/controllers/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT "statuses".* FROM "statuses"

  def show
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @employee = current_employee
    @status = @employee.statuses.create(status_params)
---
INSERT INTO "statuses" ("github_pr_link", "date", "remarks", "created_at", "updated_at", "check_in", "check_out", "daily_report", "employee_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @status.update(status_params)
---
UPDATE "statuses" SET "remarks" = ?, "updated_at" = ? WHERE "statuses"."id" = ?  [["remarks", "erergrg"], ["updated_at", "2024-02-26 11:33:07.502915"], ["id", 3]]

  def destroy
    @status.destroy
---
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]

  def current_employee
    @current_employee ||= Employee.find_by(id: session[:employee_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def set_status
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]