app/controllers/tasks_controller.rb

  def new
    @status = Status.find(params[:status_id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @status = Status.find(params[:status_id])
    @task = @status.tasks.build(task_params)
    if @task.save
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("start_time", "end_time", "title", "description", "status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "start_time" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["start_time", "2024-04-24 08:05:44"], ["updated_at", "2024-04-24 08:06:08.632904"], ["id", 1]]

  def set_status
    @status = Status.find(params[:status_id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]