app/controllers/tasks_controller.rb

INSERT INTO "logs" ("user_id", "timestamp", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["timestamp", "2024-04-24 08:06:09.418302"], ["action", "Task Updated"], ["created_at", "2024-04-24 08:06:09.432259"], ["updated_at", "2024-04-24 08:06:09.432259"]]
---
  def update
    if @task.update(task_params)
      Log.create(user_id: @current_user.id, timestamp: Time.now, action: 'Task Updated')