app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
    task = Task.find(params[:task_id])