app/controllers/time_records_controller.rb

  def index
    year = params[:year].to_i
    month = params[:month].to_i

    start_date = Date.new(year, month, 1).beginning_of_day
    end_date = start_date.end_of_month

    time_records = current_user.time_records.where(check_in_at: start_date..end_date)
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = ? AND "time_records"."check_in_at" BETWEEN ? AND ?  [["user_id", 1], ["check_in_at", "2024-03-31 18:30:00"], ["check_in_at", "2024-04-30 18:29:59.999999"]]

  def check_in
    if current_user.has_checked_in_today?
      redirect_to root_path, alert: 'You have already checked in today.'
    else
      @check_in_record = current_user.time_records.create(check_in_at: Time.current)
---
INSERT INTO "time_records" ("user_id", "check_in_at", "check_out_at", "duration_in_seconds", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def check_out
    check_in_record = current_user.time_records.last
    if check_in_record.nil?
      redirect_to root_path, alert: 'You have not Checked-In yet.'
    elsif current_user.has_checked_out_today? || check_in_record.check_out_at.present?
      redirect_to root_path, alert: 'You have already Checked-Out today.'
    else
      check_in_record.update(check_out_at: Time.current)
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = ? ORDER BY "time_records"."id" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "time_records" WHERE "time_records"."user_id" = ? AND "time_records"."check_out_at" = ? AND "time_records"."created_at" BETWEEN ? AND ? LIMIT ?  [["user_id", 3], ["check_out_at", 1], ["created_at", "2024-04-23 18:30:00"], ["created_at", "2024-04-24 18:29:59.999999"], ["LIMIT", 1]]
UPDATE "time_records" SET "check_out_at" = ?, "updated_at" = ? WHERE "time_records"."id" = ?  [["check_out_at", "2024-04-24 08:43:45.572993"], ["updated_at", "2024-04-24 08:43:45.576320"], ["id", 49]]

  def weekly_employee_count
    # Get the start and end date of the current week
    start_of_week = Date.current.beginning_of_week
    end_of_week = Date.current.end_of_week

    # Initialize an empty array to store the weekly counts
    weekly_counts = []

    # Iterate over each day of the current week
    (start_of_week..end_of_week).each do |date|
      # Count the number of employees who checked in on the current day
      count = TimeRecord.where("DATE(check_in_at) = ?", date)
                        .count
---
SELECT COUNT(*) FROM "time_records" WHERE (DATE(check_in_at) = '2024-04-22')

  def weekly_durations
    # Calculate the start and end dates of the current week
    start_date = Date.current.beginning_of_week
    end_date = Date.current.end_of_week

    # Retrieve time records for the current user within the current week's date range
    time_records = current_user.time_records.where(check_in_at: start_date.beginning_of_day..end_date.end_of_day)

    # Initialize a hash to store weekly durations for each day of the week
    weekly_durations = {
      "Monday" => 0,
      "Tuesday" => 0,
      "Wednesday" => 0,
      "Thursday" => 0,
      "Friday" => 0,
      "Saturday" => 0,
      "Sunday" => 0
    }

    # Calculate the total duration for each day of the week
    time_records.each do |record|
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = ? AND "time_records"."check_in_at" BETWEEN ? AND ?  [["user_id", 3], ["check_in_at", "2024-04-21 18:30:00"], ["check_in_at", "2024-04-28 18:29:59.999999"]]
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = ? AND "time_records"."check_in_at" BETWEEN ? AND ?  [["user_id", 1], ["check_in_at", "2024-04-21 18:30:00"], ["check_in_at", "2024-04-28 18:29:59.999999"]]