app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."role" = ?  [["role", "employee"]]
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "statuses" WHERE "statuses"."status" = ?  [["status", "pending"]]
SELECT COUNT(*) FROM "statuses" WHERE "statuses"."status" = ?  [["status", "completed"]]
SELECT COUNT(*) FROM "statuses"
SELECT COUNT(*) FROM "statuses" WHERE "statuses"."user_id" = ? AND "statuses"."status" = ?  [["user_id", 1], ["status", "pending"]]
SELECT COUNT(*) FROM "statuses" WHERE "statuses"."user_id" = ? AND "statuses"."status" = ?  [["user_id", 1], ["status", "completed"]]
SELECT COUNT(*) FROM "statuses" WHERE "statuses"."user_id" = ?  [["user_id", 1]]
SELECT "logs".* FROM "logs"
---
  def dashboard

    # Data for only Admin
    # View Employees Data
    @employees_present_count = User.where(role: 'employee').count
    @total_employees_count = User.count
    # View Reviews Data
    @pending_reviews_count = Status.where(status: 'pending').count
    @completed_reviews_count = Status.where(status: 'completed').count
    @total_reviews_count = Status.count

    # Data for only Employee
    # Assuming current_user.id represents the employee's ID
    employee_id = current_user.id
    # Pending Reviews Count for the current employee
    @current_employees_pending_reviews_count = Status.where(user_id: employee_id, status: 'pending').count
    # Completed Reviews Count for the current employee
    @current_employees_completed_reviews_count = Status.where(user_id: employee_id, status: 'completed').count
    # Total Reviews Count for the current employee
    @current_employees_total_reviews_count = Status.where(user_id: employee_id).count
    # View Logs
    @logs = Log.all