app/models/time_record.rb

SELECT 1 AS one FROM "time_records" WHERE "time_records"."user_id" = ? AND (check_in_at >= '2024-04-23 18:30:00') AND (check_in_at <= '2024-04-24 18:29:59.999999') LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def self.has_checked_in_today?(user)
    where(user_id: user.id)
      .where('check_in_at >= ?', Time.zone.now.beginning_of_day)
      .where('check_in_at <= ?', Time.zone.now.end_of_day)
      .exists?

SELECT 1 AS one FROM "time_records" WHERE "time_records"."user_id" = ? AND (check_out_at >= '2024-04-23 18:30:00') AND (check_out_at <= '2024-04-24 18:29:59.999999') LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def self.has_checked_out_today?(user)
    where(user_id: user.id)
      .where('check_out_at >= ?', Time.zone.now.beginning_of_day)
      .where('check_out_at <= ?', Time.zone.now.end_of_day)
      .exists?